diplom-src/src/DataProcessors/ВКМ_ЗаполнениеГрафика/ВКМ_ЗаполнениеГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_ЗаполнениеГрафика</name>
  <attributes>
    <name>ВКМ_ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

diplom-src/src/InformationRegisters/ВКМ_ГрафикиРаботы/ВКМ_ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикиРаботы</name>
  <resources>
    <name>ВКМ_РабочихДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

diplom-src/src/DataProcessors/ВКМ_ЗаполнениеГрафика/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни, ВКМ_ГрафикРаботы) Экспорт 
	
	Набор = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.ВКМ_ГрафикРаботы.Установить(ВКМ_ГрафикРаботы);
	
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	Дат = ДатаНачала;
	Для к = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[к];
		Если Запись.Дата < ДатаНачала Тогда
		    Продолжить;
		ИначеЕсли Запись.Дата =Дат Тогда
			Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
				Запись.ВКМ_РабочихДней = 0;
			Иначе	          
				Запись.ВКМ_РабочихДней = 1;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		Иначе
			Пока Дат < Мин(Запись.Дата, ДатаОкончания) Цикл
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.ВКМ_ГрафикРаботы = ВКМ_ГрафикРаботы;
				НоваяЗапись.Дата = Дат;
				Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					НоваяЗапись.ВКМ_РабочихДней = 0;
				Иначе	          
					НоваяЗапись.ВКМ_РабочихДней = 1;
				КонецЕсли; 
				Дат = Дат + ЧислоСекундВСутках;
			КонецЦикла; 
			Если Запись.Дата > ДатаОкончания Тогда
				Прервать;
			Иначе
				Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					Запись.ВКМ_РабочихДней = 0;
				Иначе	          
					Запись.ВКМ_РабочихДней = 1;
				КонецЕсли;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		КонецЕсли; 
	КонецЦикла;
	Набор.Записать();
	
	Пока Дат <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.ВКМ_ГрафикРаботы = ВКМ_ГрафикРаботы;
		Запись.Дата = Дат;
		Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
			Запись.ВКМ_РабочихДней = 0;
		Иначе	          
			Запись.ВКМ_РабочихДней = 1;
		КонецЕсли; 
		Дат = Дат + ЧислоСекундВСутках;
	КонецЦикла; 
	Набор.Записать();
КонецПроцедуры

#КонецОбласти


#КонецЕсли
